from django.shortcuts import render
from .forms import StanceForm
import numpy as np
import sys
sys.path.append('/F/University/7/fever/fever-persian') 
from preprocessing import extract_fact,get_docs_html,get_dataset_evidence
from django.utils.safestring import mark_safe
# from stance_detection import *  
examples = [{
            'claim':'مهدی در میان مسلمانان به عنوان منجی وعده‌داده‌شده شناخته می‌شود',
            'id':37469,
            'file':'test'#su
        },{
            'claim':'بیژن مرتضوی چیدمان تک آهنگ ها، جمله‌بندی اثر، و لحن نت‌ها بر پایهٔ قوانین کنترپوان و هارمونی را مشخص می کند.',
            'id':29025,
            'file':'test'#NE
        },{
            'claim':'منصور مهدی زاده در بازی های المپیاد نوزدهم پکن در اولین مسابقه شکست خورد.',
            'id':26056,
            'file':'test'#R
        },{
            'claim':'استان آذربایجان شرقی از سمت جنوب شرق به بخش زنجان محدود شده است.',
            'id':32431,
            'file':'test'#SU
        }]

def extract_ds_id(line):
    print(line['claim'])
    for sample in examples:
        print(sample['claim'])
        if line['claim'] == sample['claim']:
            line['label']=None
            line['id'] = sample['id']
            return sample
    line['id'] = None
    line['file'] = None
    line['label'] = None
    return line 

def Stance(request):    
    if request.method == 'POST':
        
        form = StanceForm(request.POST)
        if form.is_valid():
            line =form.cleaned_data# {"claim": "کارگردان فیلم مهتاب بری جنکینز متولد 19 نوامبر 1979 است."}
            line = extract_ds_id(line)
            line = get_dataset_evidence(line)

            line = extract_fact(line)
            docs = get_docs_html(line['predicted_pages'],line['predicted_sentences'],'evidence')
            # print("____",line['predicted_sentences'])
            print("____________________",line)
            ds_docs = None
            print("++++++++++++++++++++++++++++++++++++++",line['id'])
            try:
                if line['id'] is not None:
                    # print("___ــــــــــــــــــــــــــــــــــــــــ_",line)
                    ds_docs = get_docs_html(line['ds_pages'],line['ds_evidence'],'Ground_Truth_Evidence')
            except:
                line['ds_label']:None
                line['id']:None
            claim = form.cleaned_data['claim']
            # print("____________________",line)
            if line['label'] == None:
                line['label'] = 'NOT ENOUGH INFO'
            res = {
                'label': line['ds_label'],
                'claim': claim,
                'docs':docs,
                'ds_docs':ds_docs,
                'ds_label':line['label']
            }
            # res =  {'label': 'SUPPORTS', 'claim': 'کارگردان فیلم مهتاب بری جنکینز متولد 19 نوامبر 1979 است', 'docs': [('hyperlink_بری_جنکینز', '<span class="evidence">بری جنکینز (به انگلیسی: )؛ (زادهٔ ۱۹ نوامبر ۱۹۷۹) یک فیلم\u200cنامه\u200cنویس، و کارگردان فیلم اهل ایالات متحده آمریکا است. جنکینز ابتدا با فیلم تحسین شده دارویی برای افسردگی در سال ۲۰۰۸ اسم خود را مطرح کرد. با این\u200cحال او بخشی از هزینه\u200cهای زندگی اش را از طریق نجاری تأمین می\u200cکرد تا اینکه در تأسیس یک شرکت تبلیغاتی شریک شد. جنکینز به عنوان نویسنده در سریال بسیار موفق «بازماندگان» همکاری کرد تا اینکه بعد از هشت سال تصمیم به ساخت فیلم جدید گرفت. مهتاب به تهیه\u200cکنندگی برد پیت پروژه جدید او بود که بدون هیچ سر و صدایی کلید خورد. با اعلام خبرهای رسمی فیلم حساسیت\u200cها در مورد آن افزایش یافت. مهتاب بخاطر سوژه خاص و ملتهب خود توانست توجهات جهانی را معطوف خود کند. مهتاب با واکنش خیره\u200cکننده منتقدان همراه بوده\u200cاست و امتیاز ۹۹/۱۰۰ را دریافت کرد و در هشت رشته از جمله بهترین فیلم نامزد دریافت جایزه اسکار شده\u200cاست. مهتاب در هفتاد و چهارمین دوره گلدن گلوب موفق شد جایزه بهترین فیلم درام را از آن خود کند. بری جنکینز نامزد دریافت جایزه بهترین کارگردانی در گلدن گلوب بود که در نهایت این جایزه به دیمین شزل بخاطر ساخت فیلم لالا لند رسید. بری دوران کودکی بسیار سختی را پشت سر گذاشته است. او زمانی که بچه بود پدرش خانواده را ترک کرد چون معتقد بود بری پسر او نیست. بری وقتی دوازه سال داشت خبر مرگ پدرش را در کشوری دور دست شنید و او که مادرش هم رهایش کرده بود توسط زنی دیگر در یک خانواده شلوغ بزرگ شد.</span>'), ('مهتاب_(فیلم_۲۰۱۶)', '<span class="evidence">مهتاب  * (  انگلیسی  : \u200e) فیلمی در  ژانر   درام  و  بلوغ  به کارگردانی  بری جنکینز  است که در سال ۲۰۱۶ منتشر شد.</span><span class="evidence">فیلمنامه آن توسط خود بری جنکینز بر اساس رمان «پسرهای سیاه زیر نور مهتاب آبی به نظر می\u200cرسند»، به قلم تارل الوین مک کرینی نوشته شده\u200cاست.</span><span>جنکینز ابتدا با فیلم تحسین شده * دارویی برای افسردگی * در سال ۲۰۰۸ نام خود را مطرح کرد.</span><span>با این حال او بخشی از هزینه\u200cهای زندیگش را از طریق نجاری تأمین می\u200cکرد تا اینکه در تأسیس یک شرکت تبلیغاتی شریک شد.</span><span>جنکینز به عنوان نویسنده در سریال بسیار موفق  بازماندگان  همکاری کرد تا اینکه بعد از هشت سال تصمیم به ساخت فیلم جدید گرفت.</span><span>مهتاب به تهیه\u200cکنندگی  برد پیت  پروژه جدید او بود که بدون هیچ سر و صدایی کلید خورد.</span><span>با اعلام خبرهای رسمی فیلم حساسیت\u200cها در مورد آن افزایش یافت.</span><span>مهتاب بخاطر سوژه خاص و ملتهب خود توانست توجهات جهانی را معطوف خود کند.</span><span>مهتاب * با واکنش خیره\u200cکننده منتقدان همراه بوده\u200cاست و بر اساس ۵۱ نقد از منتقدین وب\u200cگاه  متاکریتیک  امتیاز ۹۹/۱۰۰ را دریافت کرد.</span><span></span><span>این فیلم در  هشتاد و نهمین دوره جوایز اسکار  در هشت رشته نامزد دریافت جایزه اسکار شد و موفق به دریافت جایزه  بهترین بازیگر نقش مکمل مرد  ،  بهترین فیلم  و  بهترین فیلم\u200cنامه اقتباسی  شد.</span><span>مهتاب در  هفتاد و چهارمین مراسم گلدن گلوب  موفق شد جایزه  بهترین فیلم درام  را از آن خود کند.</span><span>مهتاب با بودجهٔ بسیار ناچیز ۱٫۵ میلیونی دلاری ساخته شد و توانست در گیشه به فروشی بیشتر از ۴۰ میلیون دلار برسد.</span>'), ('بری_لارسون', '<span class="evidence"> برین سایدونی دیسولنیرز  که با نام هنری  بری لارسون  شناخته می\u200cشود (  انگلیسی  : \u200e؛ زاده ۱ اکتبر ۱۹۸۹)  هنرپیشه  ،  خواننده  ،  کارگردان  و  فیلم\u200cنامه\u200cنویس  اهل  ایالات متحده آمریکا  است.</span><span>لارسون از جوان\u200cترین بازیگران سینمای هالیوود در سال\u200cهای اخیر است که هنرنمایی\u200cاش در فیلم\u200cهای مختلف با تحسین گسترده منتقدان و تماشاگران مواجه شده\u200cاست.</span><span>او در سن ۲۶ سالگی موفق به کسب جوایز معتبری از جمله  اسکار  ،  بفتا  و  گلدن گلوب  شده\u200cاست.</span><span>بری لارسون در اولین روز اکتبر ۱۹۸۹ و در  ساکرامنتو، کالیفرنیا  به دنیا آمد.</span><span>لارسون به مدرسه نرفت و خواندن و نوشتن را در خانه آموخت.</span><span>در سن شش سالگی او به گروه آموزشی تئاتر کانسروتری پیوست تا جوانترین بازیگری باشد که موفق به این کار شده\u200cاست.</span><span>بری خیلی زود استعدادهای خود را نشان داد و مثل بسیاری از کسانی که در صدد راه یافتن به  هالیوود  هستند به  لس آنجلس  سفر کرد.</span><span>او کار بازیگری خود را در سال ۱۹۹۸ با اجرای بخش کمدی در برنامه * امشب با جی لنو * آغاز کرد.</span><span>لارسون مدت نسبتاً زیادی به بازی در آثار کمدی و خانوادگی ادامه داد.</span><span>او در سال ۲۰۰۱ در سریال  سیت\u200cکام  * بزرگ کردن بابا * در نقش امیلی استوارت ظاهر شد.</span><span>او هنگام بازی در این سریال تنها ۱۲ سال داشت.</span><span>در سال ۲۰۰۶، لارسون به همراه  لوگان لرمن  و  کودی لینلی  در فیلم کمدی *  هوت  بازی کرد.</span><span>موفقیت او در آثار طنز باعث شد تا با پیشنهادهای مشابه مواجه شود.</span><span></span><span>لارسون در سال ۲۰۱۰ در فیلم *  اسکات پیلگریم در برابر دنیا  * ظاهر شد، شهرت فیلم، نام بازیگران اکثراً جوانش از جمله لارسون بر سر زبان\u200cها انداخت.</span><span>لارسون در سال ۲۰۱۲، بازهم در یک فیلم کمدی یعنی *  خیابان جامپ شماره ۲۱  حضور پیدا کرد * که این فیلم با واکنش مثبتی از سوی منتقدان همراه بود و در گیشه نیز به فروش خوبی رسید.</span><span>در فاصله سال\u200cهای ۲۰۰۹ تا ۲۰۱۱، بیشتر وقت لارسون صرف بازی در سریال کمدی * ایالات متحده تارا * شد.</span><span>نخستین موفقیت بزرگ لارسون در سال ۲۰۱۳ و با بازی در فیلم تحسین شده *  بخش کوتاه\u200cمدت شماره ۱۲  * اتفاق افتاد.</span><span>فیلم و بازی او مورد تحسین گسترده منتقدان و تماشاگران قرار گرفت و بسیاری از ظهور یک بازیگر زن تازه\u200cنفس ابراز خوشحالی کردند.</span><span>لارسون هنگام بازی در این فیلم تنها ۲۳ سال داشت.</span><span>بعد از موفقیت * بخش کوتاه\u200cمدت شماره ۱۲ * ، لارسون دوباره به ژانر کمدی بازگشت و در آثاری همچون *  دان جان  * ، *  فاجعه  * و *  اکنون شگفت\u200cانگیز  * ظاهر شد.</span><span>در سال ۲۰۱۵، بری لارسون در فیلم *  اتاق  * بازی کرد.</span><span>بازی او در نقش یک دختر ربوده شده که سال\u200cها در اتاقی کوچک محبوس شده\u200cاست، مورد تحسین و تمجید گسترده منتقدان قرار گرفت.</span><span>لارسون به خاطر بازی در این فیلم تقریباً تمامی جوایز بازیگری را ربود و موفق به کسب  جایزه اسکار بهترین بازیگر نقش اول زن  ،  جایزه بفتای بهترین بازیگر نقش اول زن  ،  جایزه گزینش منتقدان فیلم  جایزه انجمن بازیگران و  جایزه گلدن گلوب بهترین بازیگر زن فیلم درام  شد.</span><span>این موفقیت بزرگ او باعث شد تا پایش به پروژه\u200cهای بزرگ و جریان اصلی هالیوود باز شود.</span><span>او در سال ۲۰۱۷ در فیلم *  کونگ: جزیره جمجمه  * حضور پیدا کرد که این فیلم در گیشه به فروش خوبی دست پیدا کرد.</span><span>در سال ۲۰۱۶ و در جریان  کامیک-کان بین\u200cالمللی سن دیگو  خبر رسید که لارسون قرار است به  دنیای سینمایی مارول  بپیوندد.</span><span>سپس اعلام شد او به عنوان بازیگر  کارول دنورز  انتخاب شده\u200cاست و قرار است در فیلم\u200cهای آینده مارول در این نقش ظاهر شد.</span><span>لارسون تا کنون در دو فیلم *  کاپیتان مارول  * و *  انتقام جویان:پایان بازی  * (هردو محصول سال ۲۰۱۹) این نقش را ایفا کرده\u200cاست، او همچنین در فیلم  فقط رحمت  (۲۰۱۹) به کارگردانی دستین دنیل کرتون نیز بازی کرده\u200cاست.</span><span>به عنوان کارگردان، لارسون تا کنون دو فیلم کوتاه ساخته\u200cاست.</span><span class="evidence">او در سال ۲۰۱۲ فیلم کوتاه * بازو * را ساخت که مورد توجه منتقدان قرار گرفت و سرانجام برای آن برنده جایزه هیئت دوران از  جشنواره فیلم ساندنس  شد.</span><span>او دومین فیلم کوتاه خود با عنوان * سنگینی * را در سال ۲۰۱۳ ساخت.</span><span>لارسون در نخستین تجربه کارگردانی فیلم بلند خود، فیلم کمدی *  فروشگاه تک\u200cشاخ  * را ساخت.</span><span>لارسون علاوه بر کارگردانی در فیلم به عنوان بازیگر حضور دارد.</span><span>فروشگاه تک\u200cشاخ * در تاریخ ۵ آوریل توسط  نت\u200cفلیکس  منتشر شد.</span><span></span><span>لارسون یکی از چهره\u200cهای مشهور طرفداری  برابری جنسیتی  است.</span><span>او از بازماندگان تجاوز جنسی حمایت کرده و در سخنرانی\u200cهای خود به مسائل سیاسی و اجتماعی واکنش نشان داده و جزو چهره\u200cهای سرشناس هالیوود در این حوزه محسوب می\u200cشود.</span><span>لارسون از سال ۲۰۱۳ با خواننده آمریکایی، الکس گرین\u200cوالد وارد رابطه شد اما این رابطه در سال ۲۰۱۹ به اتمام رسید و آن\u200cها از یکدیگر جدا شدند.</span>')]}
            return render(request,'factExtraction.html',res)

    else:
        form = StanceForm()
    return render(request, 'factExtraction.html', {'form': form})